-- Переводы
CREATE TABLE IF NOT EXISTS Transfers (
    FROM_ACC INT,
    TO_ACC INT,
    AMOUNT INT,
    TDATE DATE
);

-- Вставка данных
INSERT INTO Transfers (FROM_ACC, TO_ACC, AMOUNT, TDATE)
VALUES
    (1, 2, 500, '2024-01-01'),
    (2, 3, 300, '2024-01-05'),
    (3, 1, 200, '2024-01-10'),
    (2, 1, 700, '2024-01-15'),
    (1, 3, 400, '2024-01-20'),
    (3, 2, 600, '2024-01-25'),
    (2, 1, 300, '2024-02-01'),
    (3, 1, 500, '2024-02-05'),
    (1, 2, 200, '2024-02-10'),
    (2, 3, 800, '2024-02-15');